<? header('Content-Type: text/html; charset=utf-8'); ?>
<html>

<head>
    <title>Мой веб-сайт по CSS</title>
    <link rel="stylesheet" type="text/css" href="style/style.css"/>
</head>

<body>
<p>CSS это акроним для Cascading Style Sheets/Каскадных таблиц стилей.</p>

<h1>Цвет переднего плана : свойство 'color'</h1>
<hr/>
<h2>При указании шрифтов для вашего web-сайта вы, естественно, начинаете с предпочтительного шрифта, а затем
    перечисляете альтернативные. Рекомендуем в конце списка указывать родовое имя. </h2>
<hr/>
<h3>Форматирование и установка стиля текста</h3>
<hr/>
<h4 id="link1">Урок 6: Ссылки</h4>
<p>Псевдокласс :link используется для ссылок на страницы, которые пользователь ещё не посещал.</p>
<p>Псевдокласс :visited используется для ссылок на страницы, которые пользователь посетил.</p>
<p>Псевдокласс :active используется для активных ссылок.</p>
<p>Псевдокласс :hover используется для ссылок, над которыми находится указатель мыши.</p>
<a href="#link1">Эта дивная ссылка в никуда растопырится если вы наведете на нее указатель мышки</a>
<hr/>
<h4 id="link7">Урок 7: Идентификация и группирование элементов (class и id)</h4>
<p>Виноград для белого вина:</p>
<ul>
    <li><a href="ri.htm" class="whitewine">Рислинг</a></li>
    <li><a href="ch.htm" class="whitewine">Шардонэ</a></li>
    <li><a href="pb.htm" class="whitewine">Пино Блан</a></li>
</ul>

<p>Виноград для красного вина:</p>
<ul>
    <li><a href="cs.htm" class="redwine">Кабернэ Совиньон</a></li>
    <li><a href="me.htm" class="redwine">Мерло</a></li>
    <li><a href="pn.htm" class="redwine">Пино Нуар</a></li>
</ul>
<p><br/></p>
<p><br/></p>
<p><br/></p>

</body>

</html>
